Job Portal/app/Controllers/Job.php

SELECT *
FROM `job_desk`
JOIN `company` ON `company`.`idCompany` = `job_desk`.`idCompany`
WHERE `job_desk`.`deleted_at` IS NULL
 LIMIT 4, 4
SELECT COUNT(*) AS `numrows`
FROM `job_desk`
JOIN `company` ON `company`.`idCompany` = `job_desk`.`idCompany`
WHERE `job_desk`.`deleted_at` IS NULL
SELECT *
FROM `user`
WHERE `idUser` = 'USER - 6252f211c78cd'
 LIMIT 1
---
    public function index()
    {
        $data = [
            'title' => 'Lowongan kerja di Indonesia - Cari Lowongan Kerja - Karier | JobStreet.co.id',
            'jobDesk' => $this->jobDeskModel->join('company','company.idCompany = job_desk.idCompany')->paginate(4,'job_desk'),
            'pager' => $this->jobDeskModel->pager,
            'detailUser' => $this->userModel->where('idUser', session()->get('idUser'))->first(),