Job Portal/app/Controllers/UserDashboard.php

    public function user() {
        $data = [
            'title' => 'Dashboard Seeker | JobStreet.co.id',
            'profileUser' => $this->userModel->where('idUser', session()->get('idUser'))->first(),
            'detailUser' => $this->userModel->where('idUser', session()->get('idUser'))->first(),
---
SELECT *
FROM `user`
WHERE `idUser` = 'USER - 6252f211c78cd'
 LIMIT 1

    public function myApplication() {
        $data = [
            'title' => 'Dashboard Seeker | JobStreet.co.id',
            'listMyApplication' => $this->cvModel->join('user','user.idUser = cv.idUser')
                ->join('job_desk','job_desk.idJob = cv.idJob')
                ->join('resume','resume.idResume = cv.idResume')
                ->join('company','company.idCompany = job_desk.idCompany')
                ->where('cv.idUser',session()->get('idUser'))->findAll(),
            'detailUser' => $this->userModel->where('idUser', session()->get('idUser'))->first(),
---
SELECT *
FROM `user`
WHERE `idUser` = 'USER - 6252f211c78cd'
 LIMIT 1

    public function resumeCV() {
        $data = [
            'title' => 'Dashboard Seeker | JobStreet.co.id',
            'dataCV' => $this->resumeModel->where('resume.idUser', session()->get('idUser'))
                ->join('user', 'user.idUser = resume.idUser')->first(),
            'detailUser' => $this->userModel->where('idUser', session()->get('idUser'))->first(),
---
SELECT *
FROM `resume`
JOIN `user` ON `user`.`idUser` = `resume`.`idUser`
WHERE `resume`.`idUser` = 'USER - 6252f211c78cd'
 LIMIT 1
SELECT *
FROM `user`
WHERE `idUser` = 'USER - 6252f211c78cd'
 LIMIT 1

    public function getEmail() {
        $verifyUrl = "https://www.google.com/recaptcha/api/siteverify?secret=6LenRqAgAAAAADVz91V1TdG-CnaWXckRsQ9f8KHC&response=" . $this->request->getPost('response');
        $getResponse = file_get_contents($verifyUrl);
        $convertResponse = json_decode($getResponse, true);
        $convertResponse['email'] = $this->userModel->where('idUser', session()->get('idUser'))->first()['email'];
---
SELECT *
FROM `user`
WHERE `idUser` = 'USER - 6252f211c78cd'
 LIMIT 1